//let a = +prompt("A?");
//alert(a * 4);
//let a = +prompt("A?");
//alert(a ** 2);
//let a = +prompt("A?");
//let b = +prompt("B?");
//alert(2 * a * b);
//let a = +prompt("d?");
//alert(3.14 * a);
//let a = +prompt("A?");
//alert(a ** 3);
//alert(6 * a ** 2);
//let a = +prompt("A?");
//let b = +prompt("B?");
//let c = +prompt("C?");
//alert(a * b * c);
//alert(2 * (a * b + a * c + b * c))
//let a = +prompt("A?");
//alert(2 * 3.14 * a)
//alert(3.14 * a ** 2)
//let a = +prompt("A?");
//let b = +prompt("B?");
//alert((a + b) / 2)
//let a = +prompt("A?");
//let b = +prompt("B?");
//function calc(a, b) {
//    return Math.sqrt(a*b)}
//alert(Math.sqrt(a*b))
//let a = +prompt("A?");
//let b = +prompt("B?");
//alert(a ** 2 + b ** 2)
//alert(a ** 2 - b ** 2)
//alert(a ** 2 * b ** 2)
//alert(a ** 2 / b ** 2)
//let a = +prompt("A?");
//let b = +prompt("B?");
//if(a<0)
// a = -a
// if(b<0)
// b = -b
//alert(a + b)
//alert(a - b)
//alert(a * b)
//alert(a / b)
//let a = +prompt("A?");
//let b = +prompt("B?");
//function calc(a, b) {
//    return Math.sqrt(a*b)}
//alert(Math.sqrt(a ** 2 + b ** 2))
//alert((a * b) / 2)
//alert('近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床')
let a = +prompt("A?");
let b = +prompt("B?");
c = 3.14 * (a ** 2);
d = 3.14 * (b ** 2);
alert(c);
alert(d);
e = c - d;
if(e<0)
alert('近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床近前看其詳上寫着秦香蓮那三十二歲 那狀告當朝驸馬郎他欺君王啊瞞皇上 那悔婚男兒招東床')
else 
[alert(e)]
//let a = +prompt("A?");
//b = a / (2 * 3.14)
//alert(b)
//alert(3.14 * b ** 2)
//let a = +prompt("A?");
//alert(Math.sqrt(4 * a / 3.14))
//alert(Math.sqrt(4 * a / 3.14) * 3.14)
//let a = +prompt("A?");
//let b = +prompt("B?");
//c = b - a
//if(c<0)
//alert(-c)
//else[
//    alert(c)
//]

